/**
 * 角色
 */
export const ROLE_TYPE = {
	C: "C", // 客户端
	M: "M", // 经理端
}

/**
 * 环境
 */
export const PLATFORM = {
	Browser: 'H5', // 浏览器
	BrowserWX: 'WeChat', // 微信浏览器
	Devtools: 'devtools', // 微信等开发工具
	MPWX: 'mp-weixin', // 微信小程序
}

/**
 * 状态码
 */
export const RESULT_CODE = {
	/**
	 * 请求成功
	 */
	SUCCESS: "0000",
	/**
	 * 该接口需要在公众号中使用
	 */
	FOLLOW_WX: "1000",
	/**
	 * token失效
	 */
	TOKEN_INVAILD: "9997",
	/**
	 * 交易失败
	 */
	DEAL_FAILD: "1002",
	/**
	 * 请求字段有误
	 */
	FEILD_FAILD: "1003",
	/**
	 * 找不到对应记录
	 */
	NOT_FIND: "1004",
	/**
	 * 保存信息失败
	 */
	SAVE_FAILD: "1005",
	/**
	 * 不具备商家身份
	 */
	NOT_MCHT: '5001',
	/**
	 * 参数异常
	 */
	PARAM_FAILD: "9998",
	/**
	 * 系统异常
	 */
	SYS_ERROR: "9999"
}

/**
 * 状态码对于的错误信息
 */
export const RESULT_CODE_STR = {
	"0000": "请求成功",
	"1000": "该接口需要在公众号中使用",
	"9997": "token失效",
	"1002": "交易失败",
	"1003": "请求字段有误",
	"1004": "找不到对应记录",
	"1005": "保存信息失败",
	"5001": "不具备商家身份",
	"9998": "参数异常",
	"9999": "系统异常"
}

/**
 * 门店状态
 */
export const STORE_STATUS = {
	/**
	 * 申请中
	 */
	E: "E",
	/**
	 * 审批中
	 */
	A: "A",
	/**
	 * 缴纳费用
	 */
	M: "M",
	/**
	 * 补充资料
	 */
	P: "P",
	/**
	 * 签署协议中
	 */
	T: "T",
	/**
	 * 签署失败
	 */
	X: "X",
	/**
	 * 审批失败
	 */
	F: "F",
	/**
	 * 审批通过
	 */
	S: "S"
}

/**
 * 商家状态
 */
export const METCH_STATUS = {
	/**
	 * 申请中
	 */
	E: "E",
	/**
	 * 审批中
	 */
	A: "A",
	/**
	 * 终止
	 */
	F: "F",
	/**
	 * 正常
	 */
	N: "N"
}


/**
 * 商品单位
 */
export const GOODS_UNIT = {
	/**
	 * 商品单位 个
	 */
	"A": "个",
	/**
	 * 商品单位 盒
	 */
	"B": "盒",
	/**
	 * 商品单位 箱
	 */
	"C": "箱",
	/**
	 * 商品单位 箱
	 */
	"D": "套"
}

/**
 * 文件上传类型
 */
export const UPLOAD_TYPE = {
	/**
	 * 营业执照
	 */
	A: "A", //营业执照
	/**
	 * 经销商门店保证金凭证
	 */
	B: "B", //经销商门店保证金凭证
	/**
	 * 售后门店保证金凭证
	 */
	C: "C" //售后门店保证金凭证
}


/**
 * 订单状态
 */
export const purchaseStatus = {
	/**
	 * 待付款
	 */
	A: "A",
	/**
	 * 待审核
	 */
	B: "B",
	/**
	 * 待出库
	 */
	C: "C",
	/**
	 * 已取消
	 */
	D: "D",
	/**
	 * 已发货
	 */
	E: "E",
	/**
	 * 已完结
	 */
	F: "F",
	/**
	 * 发货中
	 */
	G: "G",
	/**
	 * 审核取消
	 */
	H: "H"
}

/**
 * 订单状态对应的文字
 */
export const purchaseStatusStr = {
	/**
	 * 待付款
	 */
	A: "待付款",
	/**
	 * 待审核
	 */
	B: "待审核",
	/**
	 * 待出库
	 */
	C: "待出库",
	/**
	 * 已取消
	 */
	D: "已取消",
	/**
	 * 已发货
	 */
	E: "已发货",
	/**
	 * 已完结
	 */
	F: "已完结",
	/**
	 * 发货中
	 */
	G: "发货中",
	/**
	 * 审核取消
	 */
	H: "审核取消"
}

/**
 * 资金账户类型
 */
export const AMOUNT_ACCOUNT_TYPE = {
	/**
	 * 积分账户
	 */
	Point: "Point",

	/**
	 * 现金账户 个人、商家、渠道推荐活动返利
	 */
	Cash: "Cash",

	/**
	 * 采购扣抵账户
	 */
	PurchaseDeduct: "PurchaseDeduct",

	/**
	 * 保证金账户
	 */
	Margin: "Margin",

}

/**
 * 支付状态
 */
export const PAY_STATUS = {
	/**
	 * 支付成功
	 */
	S: "S",
	/**
	 * 支付失败
	 */
	F: "F",
	/**
	 * 处理中
	 */
	P: "P",
	/**
	 * 未支付
	 */
	E: "E",
	/**
	 * 核查中
	 */
	A: "A"
}

/**
 * 门店内容状态对应的名称
 */
export const StoreContentTypeStr = {
	"I": "初始提出",
	"P": "审批中",
	"F": "审批失败",
	"S": "发布成功",
	"D": "撤销过期"
}

/**
 * 销售订单状态
 */
export const salesOrderStatus = {
	/**
	 * 进行中
	 */
	I: 'I',
	/**
	 * 已完成
	 */
	S: 'S',
	/**
	 * 取消交易
	 */
	C: 'C',
	/**
	 * 拒绝交易
	 */
	D: 'D',
	/**
	 * 支付中
	 */
	P: 'P'
}

/**
 * 销售订单状态
 */
export const salesOrderStatusStr = {
	I: "进行中",
	S: "交易成功",
	C: "交易失败",
	D: "拒绝交易",
	P: "支付中"
}

/**
 * 凭证类型
 */
export const accessoryType = {
	/**
	 * 保证金凭证
	 */
	A: 'A',
	/**
	 * 还款凭证
	 */
	B: 'B'
}

// 商城订单状态
export const IntegralOrderStatus = {
	/**
	 * 待付款
	 */
	0: 0,
	/**
	 * 待发货
	 */
	1: 1,
	/**
	 * 已发货
	 */
	2: 2,
	/**
	 * 已完成
	 */
	3: 3,
	/**
	 * 已取消
	 */
	4: 4,
	/**
	 * 退款中（退款待审核）
	 */
	5: 5,
	/**
	 * 退货中（退货待审核）
	 */
	6: 6,
	/**
	 * 已退款
	 */
	8: 8,
	/**
	 * 已退货(已退货待退款审核)
	 */
	9: 9,
	/**
	 * 待退货
	 */
	10: 10,
	/**
	 * 已退货退款
	 */
	11: 11,
	/**
	 * 退款审核中
	 */
	12: 12,
	/**
	 * 退货审核中
	 */
	13: 13
}
// 商城订单状态对应文字
export const IntegralOrderStatusStr = {
	0: '待付款',
	1: '待发货',
	2: '已发货',
	3: '已完成',
	4: '已取消',
	5: '退款中', //（退款待审核）
	6: '退货中', //（退货待审核）
	8: '已退款',
	9: '已退货,待退款', //(已退货待退款审核)
	10: '待退货',
	11: '已退货退款',
	12: '退款审核中',
	13: '退货审核中',
	14: '待出库'
}

/**
 * 营销活动状态
 */
export const ActivityStatusStr = {
	0: '未上架',
	1: '报名中',
	2: '未开始',
	3: '进行中',
	4: '已终止',
	9: '已结束'

}
